{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_17"}, "class_name": "InputLayer", "name": "input_17", "inbound_nodes": []}, {"config": {"beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_33", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "batch_normalization_33", "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "activation": "elu", "bias_regularizer": null, "name": "conv2d_62", "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 8, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_62", "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]]}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_21", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_21", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "activation": "elu", "bias_regularizer": null, "name": "conv2d_63", "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 16, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_63", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.2, "name": "dropout_21", "seed": null}, "class_name": "Dropout", "name": "dropout_21", "inbound_nodes": [[["conv2d_63", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_21", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_21", "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "activation": "elu", "bias_regularizer": null, "name": "conv2d_64", "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 8, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_64", "inbound_nodes": [[["up_sampling2d_21", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_34", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "batch_normalization_34", "inbound_nodes": [[["conv2d_64", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "name": "conv2d_65", "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 3, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d_65", "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]]}], "input_layers": [["input_17", 0, 0]], "name": "model_17", "output_layers": [["conv2d_65", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.2"}